{
    "strength": {
        "modifier": "-1",
        "value": "8"
    },
    "dexterity": {
        "modifier": "+2",
        "value": "14"
    },
    "constitution": {
        "modifier": "+2",
        "value": "14"
    },
    "intelligence": {
        "modifier": "+4",
        "value": "18"
    },
    "wisdom": {
        "modifier": "+1",
        "value": "12"
    },
    "charisma": {
        "modifier": "0",
        "value": "10"
    },
    "saving_throws": {
        "strength": {
            "proficient": false,
            "bonus": "-1"
        },
        "dexterity": {
            "proficient": false,
            "bonus": "+2"
        },
        "constitution": {
            "proficient": false,
            "bonus": "+2"
        },
        "intelligence": {
            "proficient": true,
            "bonus": "+6"
        },
        "wisdom": {
            "proficient": true,
            "bonus": "+3"
        },
        "charisma": {
            "proficient": false,
            "bonus": "+0"
        },
        "modifiers": "Advantage on INT Against Magic (Gnome Cunning)\nAdvantage on WIS Against Magic (Gnome Cunning)\nAdvantage on CHA Against Magic (Gnome Cunning)"
    },
    "initiative": "+6",
    "armor_class": "12",
    "proficiency": "+2",
    "inspiration": "1",
    "proficiencies": "===LANGUAGES===\nCommon, Draconic, Dwarvish\n\n===WEAPONS===\nLight Crossbow, Dagger, Dart, Quarterstaff, Sling\n\n===TOOLS===\nDrum, Tinker's Tools",
    "skills": {
        "acrobatics": {
            "proficient": false,
            "bonus": "+2"
        },
        "animal_handling": {
            "proficient": false,
            "bonus": "+1"
        },
        "arcana": {
            "proficient": true,
            "bonus": "+6"
        },
        "athletics": {
            "proficient": false,
            "bonus": "-1"
        },
        "deception": {
            "proficient": false,
            "bonus": "+0"
        },
        "history": {
            "proficient": true,
            "bonus": "+6"
        },
        "insight": {
            "proficient": true,
            "bonus": "+3"
        },
        "intimidation": {
            "proficient": false,
            "bonus": "+0"
        },
        "investigation": {
            "proficient": true,
            "bonus": "+6"
        },
        "medicine": {
            "proficient": false,
            "bonus": "+1"
        },
        "nature": {
            "proficient": false,
            "bonus": "+4"
        },
        "perception": {
            "proficient": false,
            "bonus": "+1"
        },
        "performance": {
            "proficient": false,
            "bonus": "+0"
        },
        "persuasion": {
            "proficient": false,
            "bonus": "+0"
        },
        "religion": {
            "proficient": false,
            "bonus": "+4"
        },
        "sleight_of_hand": {
            "proficient": false,
            "bonus": "+2"
        },
        "stealth": {
            "proficient": false,
            "bonus": "+2"
        },
        "survival": {
            "proficient": false,
            "bonus": "+1"
        }
    },
    "max_hp": "26",
    "temp_hp": "0",
    "current_hp": "26",
    "hit_dice": "4",
    "success_1": false,
    "success_2": false,
    "success_3": false,
    "failure_1": false,
    "failure_2": false,
    "failure_3": false,
    "feat_trait": "Darkvision 60ft\n\n===ARCANE RECOVERY===\nOnce per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\n===CHRONAL SHIFT===\nStarting at 2nd level, you can magically exert limited control over the flow of time around a creature. As a reaction, after you or a creature you can see within 30 feet of you makes an attack roll, an ability check, or a saving throw, you can force the creature to reroll. You make this decision after you see whether the roll succeeds or fails. The target must use the result of the second roll.\nYou can use this ability twice, and you regain any expended uses when you finish a long rest.\n\n===TEMPORAL AWARENESS===\nStarting at 2nd level, you can add your Intelligence modifier to your initiative rolls.\n\n===MOMENTARY STASIS===\nStarting at 6th level, as an action, you can magically force a Large or smaller creature you can see within 60 feet of you to make a Constitution saving throw against your spell save DC. Unless the saving throw is a success, the creature is encased in a field of magical energy until the end of your next turn or until the creature takes any damage. While encased in this way, the creature is incapacitated and has a speed of 0.\nYou can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.\n\n===ARCANE ABEYANCE===\nBeginning at 10th level, when you cast a spell using a spell slot of 4th level or lower, you can condense the spell's magic into a mote. The spell is frozen in time at the moment of casting and held within a gray bead for 1 hour. This bead is a Tiny object with AC 15 and 1 hit point, and it is immune to poison and psychic damage. When the duration ends, or if the bead is destroyed, it vanishes in a flash of light, and the spell is lost.\nA creature holding the bead can use its action to release the spell within, whereupon the bead disappears. The spell uses your spell attack bonus and save DC, and the spell treats the creature who released it as the caster for all other purposes.\nOnce you create a bead with this feature, you can't do so again until you finish a short or long rest.\n\n===CONVERGENT FUTURE===\nStarting at 14th level, you can peer through possible futures and magically pull one of them into events around you, ensuring a particular outcome. When you or a creature you can see within 60 feet of you makes an attack roll, an ability check, or a saving throw, you can use your reaction to ignore the die roll and decide whether the number rolled is the minimum needed to succeed or one less than that number (your choice).\nWhen you use this feature, you gain one level of exhaustion. Only by finishing a long rest can you remove a level of exhaustion gained in this way.\n\n===ARTIFICIER'S LORE===\nAdd twice your proficiency bonus to History checks related to magic items, alchemical objects, or technological devices. \n\n===TINKER===\nYou are proficient with tinker's tools and can use them to construct tiny clockwork devices.",
    "items": [
        {
            "name": "Light Crossbow",
            "description": "damage: 1d8 piercing\n\nrange: 80/320 ft\n\nweight: 5 lbs"
        },
        {
            "name": "Dagger",
            "description": "damage: 1d4 piercing\n\nweight: 1 lb"
        },
        {
            "name": "Dart x1",
            "description": "damage: 1d4 piercing"
        },
        {
            "name": "Quarterstaff",
            "description": "damage: 1d6 blugeoning\n\nweight: 4 lbs"
        },
        {
            "name": "Sling",
            "description": "damage: 1d4 blugeoning"
        },
        {
            "name": "Tinkers Tools",
            "description": "These special tools include the items needed to pursue a craft or trade. Proficiency with a set of artisan's tools lets you add your proficiency bonus to any ability checks you make using the tools in your craft. Each type of artisan's tools requires a separate proficiency."
        },
        {
            "name": "Net",
            "description": "A Large or smaller creature hit by a net is restrained until it is freed. A net has no effect on creatures that are formless, or creatures that are Huge or larger. A creature can use its action to make a DC 10 Strength check, freeing itself or another creature within its reach on a success. Dealing 5 slashing damage to the net (AC 10) also frees the creature without harming it, ending the effect and destroying the net. When you use an action, bonus action, or reaction to attack with a net, you can make only one attack regardless of the number of attacks you can normally make."
        },
        {
            "name": "Health Potion x2",
            "description": "2d4 + 2"
        },
        {
            "name": "Scroll of Cure Wounds",
            "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
        },
        {
            "name": "Healer's Kit x10",
            "description": "As an action, you can expend one use of the kit to stabilize a creature that has 0 hit points, without needing to make a Wisdom (Medicine) check."
        },
        {
            "name": "Rope, Hempen",
            "description": "5 ft\n10 ft\n35 ft\n50 ft"
        },
        {
            "name": "Unknown Amulet",
            "description": "Use identify on it..."
        }
    ],
    "copper": "5",
    "silver": "38",
    "gold": "323",
    "journal": [
        {
            "title": "Groups",
            "note": "Watchful Order of Mages and Protectors\nGrey Hands"
        },
        {
            "title": "Hlam (seer)",
            "note": "Monk seer in cave on side of waterdeep.\nDislikes people.\n\"Snakes twin hides face for now, expect to change before winter's end\""
        },
        {
            "title": "NPCs",
            "note": "Grenda Garloth = Xanathar gladitorial games\n\nRenare Neverember=Son of Dagult (former openlord)\n\nVajra Safahr=\"The Black Staff\"\n\nBojentra Summerdean=head of the watch\n\nFel'rekt Lafeend=keeps hunting us. Drow?"
        },
        {
            "title": "Stone of Galor",
            "note": "Key to Neverember's Enigma.\nRequires attunement.\nEyes go in holes.\nCan erase memory of something from everyone in its current plane except caster. Also wiped from history books.\nRequires incence infused with blood of Aboleth and 4 ivory strips worth at least 50 gp each.\nOnce attuned, can ask it questions about what it has erased."
        },
        {
            "title": "Xanathar",
            "note": "Gazers (watcher thing)"
        },
        {
            "title": "Zhentarim",
            "note": "Snakes.\nBlamed for the attack on the Growlhounds."
        },
        {
            "title": "Nimblewrights",
            "note": "Sold by captain Zord (drow)\nTemple of Gond = feathers\nLord Abdar = dark eyes\nThe Watch = featureless\nGrowlhound family = dead"
        },
        {
            "title": "Rynna",
            "note": "gods != patrons. More powerful means less direct.\nPatrons tend to be fey, devils, and undead.\nHers seems to be undead (probably vampire).\nBut her form of dread has scales?\nShe is a \"hollow one\" which is a mortal killed in a place with much evil and brought back to life but the soul is not with the body.\nWarlock pacts end on the death of the mortal, so Rynna's part of the contract is fulfilled.  She still has the powers though, so the contract is still active.  This is strange.  The patron may not know what is going on either."
        },
        {
            "title": "The Dragon",
            "note": "Young bronze dragon named Zelifarn"
        },
        {
            "title": "Castlelanters",
            "note": "Ran afoul with Asmodian cultists."
        },
        {
            "title": "Our Bar",
            "note": "Ghost Bartender \"Lif\"\nLilian = tea lady & bartender\nThe Theas = servers\nRenardo = wizard pastries\nIsgrad/Dupere = cooks"
        },
        {
            "title": "Gazer",
            "note": "Aberation\nArmor Class: 13\nHit Points: 13 (3d4 + 6)\nSpeed: , Can Hover\n\nSaving Throws: WIS +2\nSkills: Perception +4, Stealth +5\nCondition Immunities: Prone\nSenses: Darkvision 60 ft., Passive Perception 14"
        },
        {
            "title": "Skeleton",
            "note": "Undead\nArmor Class 13 (armor scraps)\nHit Points 13 (2d8 + 4)\nSpeed 30 ft.\n\nDamage Vulnerabilities Bludgeoning\nDamage Immunities Poison\nCondition Immunities Exhaustion, Poisoned\nSenses Darkvision 60 ft., Passive Perception 9"
        },
        {
            "title": "Wraith",
            "note": "Undead\nArmor Class 13\nHit Points 67 (9d8+27)\nSpeed 0 ft., fly 60 ft. (hover)\n\nDamage Resistance Acid, Cold, Fire, Lightning, Thunder; Bludgeoning, Piercing, and Slashing From Nonmagical Attacks That Aren't Silvered\nDamage Immunities Necrotic, Poison\nCondition Immunities Charmed, Exhaustion, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained\nSenses Darkvision 60 Ft., passive Perception 12\nLanguages The Languages It Knew In Life\n\nIncorporeal Movement. The wraith can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.\n\nSunlight Sensitivity. While in sunlight, the wraith has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
        }
    ],
    "spell_stats": {
        "prepare": "8 (int mod + wiz lvl)",
        "ability": "INT",
        "dc": "14",
        "attack": "+6"
    }
}