{
    "strength": {
        "modifier": "-1",
        "value": "8"
    },
    "dexterity": {
        "modifier": "+2",
        "value": "14"
    },
    "constitution": {
        "modifier": "+2",
        "value": "14"
    },
    "intelligence": {
        "modifier": "+4",
        "value": "18"
    },
    "wisdom": {
        "modifier": "+1",
        "value": "12"
    },
    "charisma": {
        "modifier": "0",
        "value": "10"
    },
    "saving_throws": {
        "strength": {
            "proficient": false,
            "bonus": "-1"
        },
        "dexterity": {
            "proficient": false,
            "bonus": "+2"
        },
        "constitution": {
            "proficient": false,
            "bonus": "+2"
        },
        "intelligence": {
            "proficient": true,
            "bonus": "+6"
        },
        "wisdom": {
            "proficient": true,
            "bonus": "+3"
        },
        "charisma": {
            "proficient": false,
            "bonus": "+0"
        },
        "modifiers": "Advantage on INT Against Magic (Gnome Cunning)\nAdvantage on WIS Against Magic (Gnome Cunning)\nAdvantage on CHA Against Magic (Gnome Cunning)"
    },
    "initiative": "+6",
    "armor_class": "12",
    "proficiency": "+2",
    "inspiration": "1",
    "proficiencies": "===LANGUAGES===\nCommon, Draconic, Dwarvish\n\n===WEAPONS===\nLight Crossbow, Dagger, Dart, Quarterstaff, Sling\n\n===TOOLS===\nDrum, Tinker's Tools",
    "skills": {
        "acrobatics": {
            "proficient": false,
            "bonus": "+2"
        },
        "animal_handling": {
            "proficient": false,
            "bonus": "+1"
        },
        "arcana": {
            "proficient": true,
            "bonus": "+6"
        },
        "athletics": {
            "proficient": false,
            "bonus": "-1"
        },
        "deception": {
            "proficient": false,
            "bonus": "+0"
        },
        "history": {
            "proficient": true,
            "bonus": "+6"
        },
        "insight": {
            "proficient": true,
            "bonus": "+3"
        },
        "intimidation": {
            "proficient": false,
            "bonus": "+0"
        },
        "investigation": {
            "proficient": true,
            "bonus": "+6"
        },
        "medicine": {
            "proficient": false,
            "bonus": "+1"
        },
        "nature": {
            "proficient": false,
            "bonus": "+4"
        },
        "perception": {
            "proficient": false,
            "bonus": "+1"
        },
        "performance": {
            "proficient": false,
            "bonus": "+0"
        },
        "persuasion": {
            "proficient": false,
            "bonus": "+0"
        },
        "religion": {
            "proficient": false,
            "bonus": "+4"
        },
        "sleight_of_hand": {
            "proficient": false,
            "bonus": "+2"
        },
        "stealth": {
            "proficient": false,
            "bonus": "+2"
        },
        "survival": {
            "proficient": false,
            "bonus": "+1"
        }
    },
    "max_hp": "26",
    "temp_hp": "0",
    "current_hp": "26",
    "hit_dice": "4",
    "success_1": false,
    "success_2": false,
    "success_3": false,
    "failure_1": false,
    "failure_2": false,
    "failure_3": false,
    "feat_trait": "Darkvision 60ft\n\n===ARCANE RECOVERY===\nOnce per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\n===CHRONAL SHIFT===\nStarting at 2nd level, you can magically exert limited control over the flow of time around a creature. As a reaction, after you or a creature you can see within 30 feet of you makes an attack roll, an ability check, or a saving throw, you can force the creature to reroll. You make this decision after you see whether the roll succeeds or fails. The target must use the result of the second roll.\nYou can use this ability twice, and you regain any expended uses when you finish a long rest.\n\n===TEMPORAL AWARENESS===\nStarting at 2nd level, you can add your Intelligence modifier to your initiative rolls.\n\n===MOMENTARY STASIS===\nStarting at 6th level, as an action, you can magically force a Large or smaller creature you can see within 60 feet of you to make a Constitution saving throw against your spell save DC. Unless the saving throw is a success, the creature is encased in a field of magical energy until the end of your next turn or until the creature takes any damage. While encased in this way, the creature is incapacitated and has a speed of 0.\nYou can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.\n\n===ARCANE ABEYANCE===\nBeginning at 10th level, when you cast a spell using a spell slot of 4th level or lower, you can condense the spell's magic into a mote. The spell is frozen in time at the moment of casting and held within a gray bead for 1 hour. This bead is a Tiny object with AC 15 and 1 hit point, and it is immune to poison and psychic damage. When the duration ends, or if the bead is destroyed, it vanishes in a flash of light, and the spell is lost.\nA creature holding the bead can use its action to release the spell within, whereupon the bead disappears. The spell uses your spell attack bonus and save DC, and the spell treats the creature who released it as the caster for all other purposes.\nOnce you create a bead with this feature, you can't do so again until you finish a short or long rest.\n\n===CONVERGENT FUTURE===\nStarting at 14th level, you can peer through possible futures and magically pull one of them into events around you, ensuring a particular outcome. When you or a creature you can see within 60 feet of you makes an attack roll, an ability check, or a saving throw, you can use your reaction to ignore the die roll and decide whether the number rolled is the minimum needed to succeed or one less than that number (your choice).\nWhen you use this feature, you gain one level of exhaustion. Only by finishing a long rest can you remove a level of exhaustion gained in this way.\n\n===ARTIFICIER'S LORE===\nAdd twice your proficiency bonus to History checks related to magic items, alchemical objects, or technological devices. \n\n===TINKER===\nYou are proficient with tinker's tools and can use them to construct tiny clockwork devices.",
    "items": [
        {
            "name": "Light Crossbow",
            "description": "damage: 1d8 piercing\n\nrange: 80/320 ft\n\nweight: 5 lbs"
        },
        {
            "name": "Dagger",
            "description": "damage: 1d4 piercing\n\nweight: 1 lb"
        },
        {
            "name": "Dart x1",
            "description": "damage: 1d4 piercing"
        },
        {
            "name": "Quarterstaff",
            "description": "damage: 1d6 blugeoning\n\nweight: 4 lbs"
        },
        {
            "name": "Sling",
            "description": "damage: 1d4 blugeoning"
        },
        {
            "name": "Tinkers Tools",
            "description": "These special tools include the items needed to pursue a craft or trade. Proficiency with a set of artisan's tools lets you add your proficiency bonus to any ability checks you make using the tools in your craft. Each type of artisan's tools requires a separate proficiency."
        },
        {
            "name": "Net",
            "description": "A Large or smaller creature hit by a net is restrained until it is freed. A net has no effect on creatures that are formless, or creatures that are Huge or larger. A creature can use its action to make a DC 10 Strength check, freeing itself or another creature within its reach on a success. Dealing 5 slashing damage to the net (AC 10) also frees the creature without harming it, ending the effect and destroying the net. When you use an action, bonus action, or reaction to attack with a net, you can make only one attack regardless of the number of attacks you can normally make."
        },
        {
            "name": "Health Potion x2",
            "description": "2d4 + 2"
        },
        {
            "name": "Scroll of Cure Wounds",
            "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
        },
        {
            "name": "Healer's Kit x10",
            "description": "As an action, you can expend one use of the kit to stabilize a creature that has 0 hit points, without needing to make a Wisdom (Medicine) check."
        },
        {
            "name": "Rope, Hempen",
            "description": "5 ft\n10 ft\n35 ft\n50 ft"
        },
        {
            "name": "Unknown Amulet",
            "description": "Use identify on it..."
        }
    ],
    "copper": "5",
    "silver": "38",
    "gold": "323",
    "journal": [
        {
            "title": "Groups",
            "note": "Watchful Order of Mages and Protectors\nGrey Hands"
        },
        {
            "title": "Hlam (seer)",
            "note": "Monk seer in cave on side of waterdeep.\nDislikes people.\n\"Snakes twin hides face for now, expect to change before winter's end\""
        },
        {
            "title": "NPCs",
            "note": "Grenda Garloth = Xanathar gladitorial games\n\nRenare Neverember=Son of Dagult (former openlord)\n\nVajra Safahr=\"The Black Staff\"\n\nBojentra Summerdean=head of the watch\n\nFel'rekt Lafeend=keeps hunting us. Drow?"
        },
        {
            "title": "Stone of Galor",
            "note": "Key to Neverember's Enigma.\nRequires attunement.\nEyes go in holes.\nCan erase memory of something from everyone in its current plane except caster. Also wiped from history books.\nRequires incence infused with blood of Aboleth and 4 ivory strips worth at least 50 gp each.\nOnce attuned, can ask it questions about what it has erased."
        },
        {
            "title": "Xanathar",
            "note": "Gazers (watcher thing)"
        },
        {
            "title": "Zhentarim",
            "note": "Snakes.\nBlamed for the attack on the Growlhounds."
        },
        {
            "title": "Nimblewrights",
            "note": "Sold by captain Zord (drow)\nTemple of Gond = feathers\nLord Abdar = dark eyes\nThe Watch = featureless\nGrowlhound family = dead"
        },
        {
            "title": "Rynna",
            "note": "gods != patrons. More powerful means less direct.\nPatrons tend to be fey, devils, and undead.\nHers seems to be undead (probably vampire).\nBut her form of dread has scales?\nShe is a \"hollow one\" which is a mortal killed in a place with much evil and brought back to life but the soul is not with the body.\nWarlock pacts end on the death of the mortal, so Rynna's part of the contract is fulfilled.  She still has the powers though, so the contract is still active.  This is strange.  The patron may not know what is going on either."
        },
        {
            "title": "The Dragon",
            "note": "Young bronze dragon named Zelifarn"
        },
        {
            "title": "Castlelanters",
            "note": "Ran afoul with Asmodian cultists."
        },
        {
            "title": "Our Bar",
            "note": "Ghost Bartender \"Lif\"\nLilian = tea lady & bartender\nThe Theas = servers\nRenardo = wizard pastries\nIsgrad/Dupere = cooks"
        },
        {
            "title": "Gazer",
            "note": "Aberation\nArmor Class: 13\nHit Points: 13 (3d4 + 6)\nSpeed: , Can Hover\n\nSaving Throws: WIS +2\nSkills: Perception +4, Stealth +5\nCondition Immunities: Prone\nSenses: Darkvision 60 ft., Passive Perception 14"
        },
        {
            "title": "Skeleton",
            "note": "Undead\nArmor Class 13 (armor scraps)\nHit Points 13 (2d8 + 4)\nSpeed 30 ft.\n\nDamage Vulnerabilities Bludgeoning\nDamage Immunities Poison\nCondition Immunities Exhaustion, Poisoned\nSenses Darkvision 60 ft., Passive Perception 9"
        },
        {
            "title": "Wraith",
            "note": "Undead\nArmor Class 13\nHit Points 67 (9d8+27)\nSpeed 0 ft., fly 60 ft. (hover)\n\nDamage Resistance Acid, Cold, Fire, Lightning, Thunder; Bludgeoning, Piercing, and Slashing From Nonmagical Attacks That Aren't Silvered\nDamage Immunities Necrotic, Poison\nCondition Immunities Charmed, Exhaustion, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained\nSenses Darkvision 60 Ft., passive Perception 12\nLanguages The Languages It Knew In Life\n\nIncorporeal Movement. The wraith can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.\n\nSunlight Sensitivity. While in sunlight, the wraith has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
        }
    ],
    "spell_stats": {
        "prepare": "8 (int mod + wiz lvl)",
        "ability": "INT",
        "dc": "14",
        "attack": "+6"
    },
    "spell_slots": {
        "lvl1_max": "4",
        "lvl2_max": "3",
        "lvl3_max": "",
        "lvl4_max": "",
        "lvl5_max": "",
        "lvl6_max": "",
        "lvl7_max": "",
        "lvl8_max": "",
        "lvl9_max": "",
        "lvl1_used": "3",
        "lvl2_used": "1",
        "lvl3_used": "",
        "lvl4_used": "",
        "lvl5_used": "",
        "lvl6_used": "",
        "lvl7_used": "",
        "lvl8_used": "",
        "lvl9_used": ""
    },
    "spells": [
        {
            "title": "0 Fire Bolt",
            "description": "Evocation cantrip\n\nCasting Time: 1 action\nRange: 120 feet\nComponents: V, S\nDuration: Instantaneous\n\nYou hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn’t being worn or carried.\n\nAt Higher Levels. This spell’s damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
            "prepared": true
        },
        {
            "title": "0 Mage Hand",
            "description": "Conjuration cantrip\n\nCasting Time: 1 action\nRange: 30 feet\nComponents: V, S\nDuration: 1 minute\n\nA spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\n\nYou can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.\n\nThe hand can’t attack, activate magical items, or carry more than 10 pounds.",
            "prepared": true
        },
        {
            "title": "0 Prestidigitation",
            "description": "Transmutation cantrip\n\nCasting Time: 1 action\nRange: 10 feet\nComponents: V, S\nDuration: Up to 1 hour\n\nThis spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range:\n\nYou create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.\nYou instantaneously light or snuff out a candle, a torch, or a small campfire.\nYou instantaneously clean or soil an object no larger than 1 cubic foot.\nYou chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.\nYou make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.\nYou create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.\nIf you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.",
            "prepared": true
        },
        {
            "title": "0 Ray of Frost",
            "description": "Evocation cantrip\n\nCasting Time: 1 action\nRange: 60 feet\nComponents: V, S\nDuration: Instantaneous\n\nA frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.\n\nAt Higher Levels. The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
            "prepared": true
        },
        {
            "title": "1 Alarm [R]",
            "description": "1st-level abjuration (ritual)\n\nCasting Time: 1 minute\nRange: 30 feet\nComponents: V, S, M (a tiny bell and a piece of fine silver wire)\nDuration: 8 hours\n\nYou set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won’t set off the alarm. You also choose whether the alarm is mental or audible.\n\nA mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping. An audible alarm produces the sound of a hand bell for 10 seconds within 60 feet.",
            "prepared": false
        },
        {
            "title": "1 Burning Hands",
            "description": "1st-level evocation\n\nCasting Time: 1 action\nRange: Self (15-foot cone)\nComponents: V, S\nDuration: Instantaneous\n\nAs you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.\n\nThe fire ignites any flammable objects in the area that aren’t being worn or carried.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
            "prepared": false
        },
        {
            "title": "1 Catapult",
            "description": "1st-level transmutation\n\nCasting Time: 1 action\nRange: 60 feet\nComponents: S\nDuration: Instantaneous\n\nChoose one object weighing 1 to 5 pounds within range that isn’t being worn or carried. The object flies in a straight line up to 90 feet in a direction you choose before falling to the ground, stopping early if it impacts against a solid surface. If the object would strike a creature, that creature must make a Dexterity saving throw. On a failed save, the object strikes the target and stops moving. When the object strikes something, the object and what it strikes each take 3d8 bludgeoning damage.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the maximum weight of objects that you can target with this spell increases by 5 pounds, and the damage increases by 1d8, for each slot level above 1st.",
            "prepared": false
        },
        {
            "title": "1 Command (free)",
            "description": "Got this with fey-touched feat, so I can cast it once for free per long rest.\n\n1st-level enchantment\n\nCasting Time: 1 action\nRange: 60 feet\nComponents: V\nDuration: 1 round\n\nYou speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn’t understand your language, or if your command is directly harmful to it. Some typical commands and their effects follow. You might issue a command other than one described here. If you do so, the DM determines how the target behaves. If the target can’t follow your command, the spell ends.\n\nApproach. The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you.\n\nDrop. The target drops whatever it is holding and then ends its turn.\n\nFlee. The target spends its turn moving away from you by the fastest available means.\n\nGrovel. The target falls prone and then ends its turn.\n\nHalt. The target doesn’t move and takes no actions. A flying creature stays aloft, provided that it is able to do so. If it must move to stay aloft, it flies the minimum distance needed to remain in the air.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
            "prepared": false
        },
        {
            "title": "1 Comprehend Languages [R]",
            "description": "1st-level divination (ritual)\n\nCasting Time: 1 action\nRange: Self\nComponents: V, S, M (a pinch of soot and salt)\nDuration: 1 hour\n\nFor the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text.\n\nThis spell doesn’t decode secret messages in a text or glyph, such as an arcane sigil, that isn’t part of a written language.",
            "prepared": false
        },
        {
            "title": "1 Detect Magic [R]",
            "description": "1st-level divination (ritual)\n\nCasting Time: 1 action\nRange: Self\nComponents: V, S\nDuration: Concentration, up to 10 minutes\n\nFor the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\n\nThe spell can penetrate most barriers, but is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.",
            "prepared": false
        },
        {
            "title": "1 Disguise Self",
            "description": "1st-level illusion\n\nCasting Time: 1 action\nRange: Self\nComponents: V, S\nDuration: 1 hour\n\nYou make yourself – including your clothing, armor, weapons, and other belongings on your person – look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.\n\nThe changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair. To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
            "prepared": false
        },
        {
            "title": "1 False Life",
            "description": "1st-level necromancy\n\nCasting Time: 1 action\nRange: Self\nComponents: V, S, M (a small amount of alcohol or distilled spirits)\nDuration: 1 hour\n\nBolstering yourself with a necromantic facsimile of life, you gain 1d4 + 4 temporary hit points for the duration.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you gain 5 additional temporary hit points for each slot level above 1st.",
            "prepared": false
        },
        {
            "title": "1 Feather Fall",
            "description": "1st-level transmutation\n\nCasting Time: 1 reaction, which you take when you or a creature within 60 feet of you falls\nRange: 60 feet\nComponents: V, M (a small feather or piece of down)\nDuration: 1 minute\n\nChoose up to five falling creatures within range. A falling creature’s rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature.",
            "prepared": false
        },
        {
            "title": "1 Find Familiar [R]",
            "description": "1st-level conjuration (ritual)\n\nCasting Time: 1 hour\nRange: 10 feet\nComponents: V, S, M (10 gp worth of charcoal, incense, and herbs that must be consumed by fire in a brass brazier)\nDuration: Instantaneous\n\nYou gain the service of a familiar, a spirit that takes an animal form you choose: bat, cat, crab, frog (toad), hawk, lizard, octopus, owl, poisonous snake, fish (quipper), rat, raven, sea horse, spider, or weasel. Appearing in an unoccupied space within range, the familiar has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of a beast.\n\nYour familiar acts independently of you, but it always obeys your commands. In combat, it rolls its own initiative and acts on its own turn. A familiar can’t attack, but it can take other actions as normal.\n\nWhen the familiar drops to 0 hit points, it disappears, leaving behind no physical form. It reappears after you cast this spell again. As an action, you can temporarily dismiss your familiar to a pocket dimension. Alternatively, you can dismiss it forever. As an action while it is temporarily dismissed, you can cause it to reappear in any unoccupied space within 30 feet of you. Whenever the familiar drops to 0 hit points or disappears into the pocket dimension, it leaves behind in its space anything it was wearing or carrying.\n\nWhile your familiar is within 100 feet of you, you can communicate with it telepathically. Additionally, as an action, you can see through your familiar’s eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the familiar has. During this time, you are deaf and blind with regard to your own senses.\n\nYou can’t have more than one familiar at a time. If you cast this spell while you already have a familiar, you instead cause it to adopt a new form. Choose one of the forms from the above list. Your familiar transforms into the chosen creature.\n\nFinally, when you cast a spell with a range of touch, your familiar can deliver the spell as if it had cast the spell. Your familiar must be within 100 feet of you, and it must use its reaction to deliver the spell when you cast it. If the spell requires an attack roll, you use your attack modifier for the roll.",
            "prepared": false
        },
        {
            "title": "1 Identify [R]",
            "description": "1st-level divination (ritual)\n\nCasting Time: 1 minute\nRange: Touch\nComponents: V, S, M (a pearl worth at least 100 gp and an owl feather)\nDuration: Instantaneous\n\nYou choose one object that you must touch throughout the casting of the spell. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it.\n\nIf you instead touch a creature throughout the casting, you learn what spells, if any, are currently affecting it.",
            "prepared": false
        },
        {
            "title": "1 Mage Armor",
            "description": "1st-level abjuration\n\nCasting Time: 1 action\nRange: Touch\nComponents: V, S, M (a piece of cured leather)\nDuration: 8 hours\n\nYou touch a willing creature who isn’t wearing armor, and a protective magical force surrounds it until the spell ends. The target’s base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.",
            "prepared": false
        },
        {
            "title": "1 Magic Missile",
            "description": "1st-level evocation\n\nCasting Time: 1 action\nRange: 120 feet\nComponents: V, S\nDuration: Instantaneous\n\nYou create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously and you can direct them to hit one creature or several.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.",
            "prepared": false
        },
        {
            "title": "1 Shield",
            "description": "1st-level abjuration\n\nCasting Time: 1 reaction, which you take when you are hit by an attack or targeted by the magic missile spell\nRange: Self\nComponents: V, S\nDuration: 1 round\n\nAn invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
            "prepared": false
        },
        {
            "title": "1 Silent Image",
            "description": "1st-level illusion\n\nCasting Time: 1 action\nRange: 60 feet\nComponents: V, S, M (a bit of fleece)\nDuration: Concentration, up to 10 minutes\n\nYou create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn’t accompanied by sound, smell, or other sensory effects.\n\nYou can use your action to cause the image to move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking.\n\nPhysical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image.",
            "prepared": false
        },
        {
            "title": "1 Silvery Barbs",
            "description": "1st-level Enchantment\n\nCasting Time: 1 reaction, which you take when a creature you can see within 60 feet of yourself succeeds on an attack roll, an ability check, or a saving throw\nRange: 60 feet\nComponents: V\nDuration: Instantaneous\n\nYou magically distract the triggering creature and turn its momentary uncertainty into encouragement for another creature. The triggering creature must reroll the d20 and use the lower roll.\n\nYou can then choose a different creature you can see within range (you can choose yourself). The chosen creature has advantage on the next attack roll, ability check, or saving throw it makes within 1 minute. A creature can be empowered by only one use of this spell at a time.",
            "prepared": false
        },
        {
            "title": "1 Sleep",
            "description": "1st-level enchantment\n\nCasting Time: 1 action\nRange: 90 feet\nComponents: V, S, M (a pinch of fine sand, rose petals, or a cricket)\nDuration: 1 minute\n\nThis spell sends creatures into a magical slumber. Roll 5d8, the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).\n\nStarting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for that creature to be affected. Undead and creatures immune to being charmed aren’t affected by this spell.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.",
            "prepared": false
        },
        {
            "title": "1 Unseen Servant [R]",
            "description": "1st-level conjuration (ritual)\n\nCasting Time: 1 action\nRange: 60 feet\nComponents: V, S, M (a piece of string and a bit of wood)\nDuration: 1 hour\n\nThis spell creates an invisible, mindless, shapeless, Medium force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can’t attack. If it drops to 0 hit points, the spell ends.\n\nOnce on each of your turns as a bonus action, you can mentally command the servant to move up to 15 feet and interact with an object. The servant can perform simple tasks that a human servant could do, such as fetching things, cleaning, mending, folding clothes, lighting fires, serving food, and pouring wine. Once you give the command, the servant performs the task to the best of its ability until it completes the task, then waits for your next command.\n\nIf you command the servant to perform a task that would move it more than 60 feet away from you, the spell ends.",
            "prepared": false
        },
        {
            "title": "1 Witch Bolt",
            "description": "1st-level evocation\n\nCasting Time: 1 action\nRange: 30 feet\nComponents: V, S, M (a twig from a tree that has been struck by lightning)\nDuration: Concentration, up to 1 minute\n\nA beam of crackling, blue energy lances out toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. The spell ends if you use your action to do anything else. The spell also ends if the target is ever outside the spell’s range or if it has total cover from you.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by 1d12 for each slot level above 1st.",
            "prepared": false
        },
        {
            "title": "2 Dragon's Breath",
            "description": "2nd-level transmutation\n\nCasting Time: 1 bonus action\nRange: Touch\nComponents: V, S, M (a hot pepper)\nDuration: Concentration, up to 1 minute\n\nYou touch one willing creature and imbue it with the power to spew magical energy from its mouth, provided it has one. Choose acid, cold, fire, lightning, or poison. Until the spell ends, the creature can use an action to exhale energy of the chosen type in a 15-foot cone. Each creature in that area must make a Dexterity saving throw, taking 3d6 damage of the chosen type on a failed save, or half as much damage on a successful one.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
            "prepared": false
        },
        {
            "title": "2 Enlarge Reduce",
            "description": "2nd-level transmutation\n\nCasting Time: 1 action\nRange: 30 feet\nComponents: V, S, M (a pinch of powdered iron)\nDuration: Concentration, up to 1 minute\n\nYou cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose either a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect.\n\nIf the target is a creature, everything it is wearing and carrying changes size with it. Any item dropped by an affected creature returns to normal size at once.\n\nEnlarge. The target’s size doubles in all dimensions, and its weight is multiplied by eight. This growth increases its size by one category – from Medium to Large, for example. If there isn’t enough room for the target to double its size, the creature or object attains the maximum possible size in the space available. Until the spell ends, the target also has advantage on Strength checks and Strength saving throws. The target’s weapons also grow to match its new size. While these weapons are enlarged, the target’s attack with them deal 1d4 extra damage.\n\nReduce. The target’s size is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one category – from Medium to Small, for example. Until the spell ends, the target also has disadvantage on Strength checks and Strength saving throws. The target’s weapons also shrink to match its new size. While these weapons are reduced, the target’s attacks with them deal 1d4 less damage (this can’t reduce the damage below 1).",
            "prepared": false
        },
        {
            "title": "2 Levitate",
            "description": "2nd-level transmutation\n\nCasting Time: 1 action\nRange: 60 feet\nComponents: V, S, M (either a small leather loop or a piece of golden wire bent into a cup shape with a long shank on one end)\nDuration: Concentration, up to 10 minutes\n\nOne creature or loose object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a Constitution saving throw is unaffected.\n\nThe target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target’s altitude by up to 20 feet in either direction on your turn. If you are the target, you can move up or down as part of your move. Otherwise, you can use your action to move the target, which must remain within the spell’s range.\n\nWhen the spell ends, the target floats gently to the ground if it is still aloft.",
            "prepared": false
        },
        {
            "title": "2 Misty Step (free)",
            "description": "The fey touched feat lets me use this once per long rest for free\n\n2nd-level conjuration\n\nCasting Time: 1 bonus action\nRange: Self\nComponents: V\nDuration: Instantaneous\n\nBriefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.",
            "prepared": false
        },
        {
            "title": "2 Rope Trick",
            "description": "2nd-level transmutation\n\nCasting Time: 1 action\nRange: Touch\nComponents: V, S, M (powdered corn extract and a twisted loop of parchment)\nDuration: 1 hour\n\nYou touch a length of rope that is up to 60 feet long. One end of the rope then rises into the air until the whole rope hangs perpendicular to the ground. At the upper end of the rope, an invisible entrance opens to an extradimensional space that lasts until the spell ends.\n\nThe extradimensional space can be reached by climbing to the top of the rope. The space can hold as many as eight Medium or smaller creatures. The rope can be pulled into the space, making the rope disappear from view outside the space.\n\nAttacks and spells can’t cross through the entrance into or out of the extradimensional space, but those inside can see out of it as if through a 3-foot-by-5-foot window centered on the rope.\n\nAnything inside the extradimensional space drops out when the spell ends.",
            "prepared": false
        },
        {
            "title": "2 Scorching Ray",
            "description": "2nd-level evocation\n\nCasting Time: 1 action\nRange: 120 feet\nComponents: V, S\nDuration: Instantaneous\n\nYou create three rays of fire and hurl them at targets within range. You can hurl them at one target or several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you create one additional ray for each slot level above 2nd.",
            "prepared": false
        },
        {
            "title": "2 Shatter",
            "description": "2nd-level evocation\n\nCasting Time: 1 action\nRange: 60 feet\nComponents: V, S, M (a chip of mica)\nDuration: Instantaneous\n\nA sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw.\n\nA nonmagical object that isn’t being worn or carried also takes the damage if it’s in the spell’s area.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
            "prepared": false
        },
        {
            "title": "2 Vortex Warp",
            "description": "2nd-level Conjuration\n\nCasting Time: 1 action\nRange: 90 feet\nComponents: V, S\nDuration: Instantaneous\n\nYou magically twist space around another creature you can see within range. The target must succeed on a Constitution saving throw (the target can choose to fail), or the target is teleported to an unoccupied space of your choice that you can see within range. The chosen space must be on a surface or in a liquid that can support the target without the target having to squeeze.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the range of the spell increases by 30 feet for each slot level above 2nd.",
            "prepared": false
        }
    ]
}